Tekla Open API Reference for Tekla Structures 2025
PourObjectFilterExpressions.PourType Constructor
 Initializes a new instance of the PourType class.
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PourType()
Public Sub New
See Also
Reference
PourObjectFilterExpressions.PourType Class
Tekla.Structures.Filtering.Categories Namespace